[
    {
        "summary": "The Time Machine is a science fiction novel by H. G. Wells, published in 1895 and written as a frame narrative. Wells is generally credited with the popularization of the concept of time travel by using a vehicle that allows an operator to travel purposely and selectively forwards or backwards in time. The term \"time machine\", coined by Wells, is now almost universally used to refer to such a vehicle.\nThe Time Machine has been adapted into three feature films of the same name, as well as two television versions, and a large number of comic book adaptations. It has also indirectly inspired many more works of fiction in many media productions.",
        "title": "The Time Machine",
        "id": 1,
        "author": "531EDFA6-A361-4E15-873F-45E4EA0AF120",
        "pages": 118,
        "cover": "https://images.gr-assets.com/books/1327942880l/2493.jpg",
        "plot": "The book's protagonist is an English scientist and gentleman inventor living in Richmond, Surrey, in Victorian England, and identified by a narrator simply as the Time Traveller. The narrator recounts the Traveller's lecture to his weekly dinner guests that time is simply a fourth dimension and his demonstration of a tabletop model machine for travelling through it. He reveals that he has built a machine capable of carrying a person through time, and returns at dinner the following week to recount a remarkable tale, becoming the new narrator.\nIn the new narrative, the Time Traveller tests his device with a journey that takes him to A.D. 802,701, where he meets the Eloi, a society of small, elegant, childlike adults. They live in small communities within large and futuristic yet slowly deteriorating buildings, doing no work and having a frugivorous diet. His efforts to communicate with them are hampered by their lack of curiosity or discipline, and he speculates that they are a peaceful, communist society, the result of humanity conquering nature with technology, and subsequently evolving to adapt to an environment in which strength and intellect are no longer advantageous to survival.\nReturning to the site where he arrived, the Time Traveller is shocked to find his time machine missing and eventually concludes that it has been dragged by some unknown party into a nearby structure with heavy doors, locked from the inside, which resembles a Sphinx. Luckily, he had removed the machine's levers before leaving it (the time machine being unable to travel through time without them). Later in the dark, he is approached menacingly by the Morlocks, ape-like troglodytes who live in darkness underground and surface only at night. Within their dwellings, he discovers the machinery and industry that makes the above-ground paradise possible. He alters his theory, speculating that the human race has evolved into two species: the leisured classes have become the ineffectual Eloi, and the downtrodden working classes have become the brutal light-fearing Morlocks. Deducing that the Morlocks have taken his time machine, he explores the Morlock tunnels, learning that due to a lack of any other means of sustenance, they feed on the Eloi. His revised analysis is that their relationship is not one of lords and servants but of livestock and ranchers. The Time Traveller theorizes that intelligence is the result of and response to danger; with no real challenges facing the Eloi, they have lost the spirit, intelligence, and physical fitness of humanity at its peak.\nMeanwhile, he saves an Eloi named Weena from drowning as none of the other Eloi take any notice of her plight, and they develop an innocently affectionate relationship over the course of several days. He takes Weena with him on an expedition to a distant structure that turns out to be the remains of a museum, where he finds a fresh supply of matches and fashions a crude weapon against Morlocks, whom he must fight to get back his machine. He plans to take Weena back to his own time. Because the long and tiring journey back to Weena's home is too much for them, they stop in the forest, and they are then overcome by Morlocks in the night, and Weena faints. The Traveller escapes when a small fire he had left behind them to distract the Morlocks catches up to them as a forest fire; Weena and the pursuing Morlocks are lost in the fire, and the Time Traveler is devastated over his loss.\nThe Morlocks open the Sphinx and use the time machine as bait to capture the Traveller, not understanding that he will use it to escape. He reattaches the levers before he travels further ahead to roughly 30 million years from his own time. There he sees some of the last living things on a dying Earth: menacing reddish crab-like creatures slowly wandering the blood-red beaches chasing enormous butterflies in a world covered in simple lichenous vegetation. He continues to make short jumps through time, seeing Earth's rotation gradually cease and the sun grow larger, redder, and dimmer, and the world falling silent and freezing as the last degenerate living things die out.\nOverwhelmed, he goes back to the machine and returns to Victorian time, arriving at his laboratory just three hours after he originally left. Interrupting dinner, he relates his adventures to his disbelieving visitors, producing as evidence two strange white flowers Weena had put in his pocket. The original narrator then takes over and relates that he returned to the Time Traveller's house the next day, finding him preparing for another journey. After promising to return in a short period of time, the narrator reveals that after 3 years of waiting, the Time Traveller has never returned.",
        "year": 1895,
        "isbn": "0451528557",
        "rating": 3.87
    },
    {
        "summary": "The War of the Worlds is a science fiction novel by English author H. G. Wells first serialised in 1897 in the UK by Pearson's Magazine and in the United States by Cosmopolitan magazine. The novel's first appearance in hardcover was in 1898 from publisher William Heinemann of London. Written between 1895 and 1897, it is one of the earliest stories that detail a conflict between mankind and an extraterrestrial race. The novel is the first-person narrative of both an unnamed protagonist in Surrey and of his younger brother in London as southern England is invaded by Martians. The novel is one of the most commented-on works in the science fiction canon.\nThe plot has been related to invasion literature of the time. The novel has been variously interpreted as a commentary on evolutionary theory, British imperialism, and generally Victorian superstitions, fears and prejudices. At the time of publication, it was classified as a scientific romance, like Wells' earlier novel The Time Machine. The War of the Worlds has been both popular (having never been out of print) and influential, spawning half a dozen feature films, radio dramas, a record album, various comic book adaptations, a television series, and sequels or parallel stories by other authors. It has even influenced the work of scientists, notably Robert H. Goddard, who, inspired by the book, invented both the liquid fuelled rocket and multistage rocket, which resulted in the Apollo 11 Moon landing 71 years later.",
        "title": "The War of the Worlds",
        "id": 2,
        "author": "531EDFA6-A361-4E15-873F-45E4EA0AF120",
        "pages": 192,
        "cover": "https://images.gr-assets.com/books/1320391644l/8909.jpg",
        "plot": "Yet across the gulf of space, minds that are to our minds as ours are to those of the beasts that perish, intellects vast and cool and unsympathetic, regarded this earth with envious eyes, and slowly and surely drew their plans against us.",
        "year": 1898,
        "isbn": "0375759239",
        "rating": 3.8
    },
    {
        "summary": "A Princess of Mars is a science fantasy novel by American writer Edgar Rice Burroughs, the first of his Barsoom series. It was first serialized in the pulp magazine All-Story Magazine from February–July, 1912. Full of swordplay and daring feats, the novel is considered a classic example of 20th-century pulp fiction. It is also a seminal instance of the planetary romance, a subgenre of science fantasy that became highly popular in the decades following its publication. Its early chapters also contain elements of the Western. The story is set on Mars, imagined as a dying planet with a harsh desert environment. This vision of Mars was based on the work of the astronomer Percival Lowell, whose ideas were widely popularized in the late 19th and early 20th centuries.\nThe Barsoom series inspired a number of well-known 20th-century science fiction writers, including Jack Vance, Ray Bradbury, Arthur C. Clarke, Robert A. Heinlein, and John Norman. The series was also inspirational for many scientists in the fields of space exploration and the search for extraterrestrial life, including Carl Sagan, who read A Princess of Mars when he was a child.",
        "title": "A Princess of Mars",
        "id": 3,
        "author": "529E6C18-1D27-4056-BB47-9173637E4D5C",
        "pages": 186,
        "cover": "https://images.gr-assets.com/books/1332272118l/40395.jpg",
        "plot": "John Carter, a Confederate veteran of the American Civil War, goes prospecting in Arizona immediately after the war's end. Having struck a rich vein of gold, he runs afoul of the Apaches. While attempting to evade pursuit by hiding in a sacred cave, he is mysteriously transported to Mars, called \"Barsoom\" by its inhabitants. Carter finds that he has great strength and superhuman agility in this new environment as a result of its lesser gravity and lower atmospheric pressure. He soon falls in with a nomadic tribe of Green Martians, or Tharks, as the planet's warlike, six-limbed, green-skinned inhabitants are known. Thanks to his strength and martial prowess, Carter rises to a high position in the tribe and earns the respect and eventually the friendship of Tars Tarkas, one of the Thark chiefs.\nThe Tharks subsequently capture Dejah Thoris, Princess of Helium, a member of the humanoid red Martian race. The red Martians inhabit a loose network of city-states and control the desert planet's canals, along which its agriculture is concentrated. Carter rescues Dejah Thoris from the green men in a bid to return her to her people.\nSubsequently, Carter becomes embroiled in the political affairs of both the red and green Martians in his efforts to safeguard Dejah Thoris, eventually leading a horde of Tharks against the city-state of Zodanga, the historic enemy of Helium. Winning Dejah Thoris' heart, he becomes Prince of Helium, and the two live happily together for nine years. However, the sudden breakdown of the Atmosphere Plant that sustains the planet's waning air supply endangers all life on Barsoom. In a desperate attempt to save the planet's inhabitants, Carter uses a secret telepathic code to enter the factory, bringing an engineer along who can restore its functionality. Carter then succumbs to asphyxiation, only to awaken back on Earth, left to wonder what has become of Barsoom and his beloved.",
        "year": 1912,
        "isbn": "0143104888",
        "rating": 3.8
    }
]
